RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_srss_v2.h
/* SRSS.PWR_LVD_STATUS */
#define SRSS_V2_PWR_LVD_STATUS_HVLVD1_OUT_Pos   0UL
#define SRSS_V2_PWR_LVD_STATUS_HVLVD1_OUT_Msk   0x1UL
/* SRSS.PWR_LVD_STATUS2 */
#define SRSS_V2_PWR_LVD_STATUS2_HVLVD2_OUT_Pos  0UL
#define SRSS_V2_PWR_LVD_STATUS2_HVLVD2_OUT_Msk  0x1UL
/* SRSS.CLK_DSI_SELECT */
#define SRSS_V2_CLK_DSI_SELECT_DSI_MUX_Pos      0UL
#define SRSS_V2_CLK_DSI_SELECT_DSI_MUX_Msk      0x1FUL
/* SRSS.CLK_OUTPUT_FAST */
#define SRSS_V2_CLK_OUTPUT_FAST_FAST_SEL0_Pos   0UL
#define SRSS_V2_CLK_OUTPUT_FAST_FAST_SEL0_Msk   0xFUL
#define SRSS_V2_CLK_OUTPUT_FAST_PATH_SEL0_Pos   4UL
#define SRSS_V2_CLK_OUTPUT_FAST_PATH_SEL0_Msk   0xF0UL
#define SRSS_V2_CLK_OUTPUT_FAST_HFCLK_SEL0_Pos  8UL
#define SRSS_V2_CLK_OUTPUT_FAST_HFCLK_SEL0_Msk  0xF00UL
#define SRSS_V2_CLK_OUTPUT_FAST_FAST_SEL1_Pos   16UL
#define SRSS_V2_CLK_OUTPUT_FAST_FAST_SEL1_Msk   0xF0000UL
#define SRSS_V2_CLK_OUTPUT_FAST_PATH_SEL1_Pos   20UL
#define SRSS_V2_CLK_OUTPUT_FAST_PATH_SEL1_Msk   0xF00000UL
#define SRSS_V2_CLK_OUTPUT_FAST_HFCLK_SEL1_Pos  24UL
#define SRSS_V2_CLK_OUTPUT_FAST_HFCLK_SEL1_Msk  0xF000000UL
/* SRSS.CLK_OUTPUT_SLOW */
#define SRSS_V2_CLK_OUTPUT_SLOW_SLOW_SEL0_Pos   0UL
#define SRSS_V2_CLK_OUTPUT_SLOW_SLOW_SEL0_Msk   0xFUL
#define SRSS_V2_CLK_OUTPUT_SLOW_SLOW_SEL1_Pos   4UL
#define SRSS_V2_CLK_OUTPUT_SLOW_SLOW_SEL1_Msk   0xF0UL
/* SRSS.CLK_CAL_CNT1 */
#define SRSS_V2_CLK_CAL_CNT1_CAL_COUNTER1_Pos   0UL
#define SRSS_V2_CLK_CAL_CNT1_CAL_COUNTER1_Msk   0xFFFFFFUL
#define SRSS_V2_CLK_CAL_CNT1_CAL_COUNTER_DONE_Pos 31UL
#define SRSS_V2_CLK_CAL_CNT1_CAL_COUNTER_DONE_Msk 0x80000000UL
/* SRSS.CLK_CAL_CNT2 */
#define SRSS_V2_CLK_CAL_CNT2_CAL_COUNTER2_Pos   0UL
#define SRSS_V2_CLK_CAL_CNT2_CAL_COUNTER2_Msk   0xFFFFFFUL
/* SRSS.SRSS_INTR */
#define SRSS_V2_SRSS_INTR_HVLVD1_Pos            1UL
#define SRSS_V2_SRSS_INTR_HVLVD1_Msk            0x2UL
#define SRSS_V2_SRSS_INTR_HVLVD2_Pos            2UL
#define SRSS_V2_SRSS_INTR_HVLVD2_Msk            0x4UL
#define SRSS_V2_SRSS_INTR_CLK_CAL_Pos           5UL
#define SRSS_V2_SRSS_INTR_CLK_CAL_Msk           0x20UL
/* SRSS.SRSS_INTR_SET */
#define SRSS_V2_SRSS_INTR_SET_HVLVD1_Pos        1UL
#define SRSS_V2_SRSS_INTR_SET_HVLVD1_Msk        0x2UL
#define SRSS_V2_SRSS_INTR_SET_HVLVD2_Pos        2UL
#define SRSS_V2_SRSS_INTR_SET_HVLVD2_Msk        0x4UL
#define SRSS_V2_SRSS_INTR_SET_CLK_CAL_Pos       5UL
#define SRSS_V2_SRSS_INTR_SET_CLK_CAL_Msk       0x20UL
/* SRSS.SRSS_INTR_MASK */
#define SRSS_V2_SRSS_INTR_MASK_HVLVD1_Pos       1UL
#define SRSS_V2_SRSS_INTR_MASK_HVLVD1_Msk       0x2UL
#define SRSS_V2_SRSS_INTR_MASK_HVLVD2_Pos       2UL
#define SRSS_V2_SRSS_INTR_MASK_HVLVD2_Msk       0x4UL
#define SRSS_V2_SRSS_INTR_MASK_CLK_CAL_Pos      5UL
#define SRSS_V2_SRSS_INTR_MASK_CLK_CAL_Msk      0x20UL
/* SRSS.SRSS_INTR_MASKED */
#define SRSS_V2_SRSS_INTR_MASKED_HVLVD1_Pos     1UL
#define SRSS_V2_SRSS_INTR_MASKED_HVLVD1_Msk     0x2UL
#define SRSS_V2_SRSS_INTR_MASKED_HVLVD2_Pos     2UL
#define SRSS_V2_SRSS_INTR_MASKED_HVLVD2_Msk     0x4UL
#define SRSS_V2_SRSS_INTR_MASKED_CLK_CAL_Pos    5UL
#define SRSS_V2_SRSS_INTR_MASKED_CLK_CAL_Msk    0x20UL
/* SRSS.PWR_CTL */
#define SRSS_V2_PWR_CTL_POWER_MODE_Pos          0UL
#define SRSS_V2_PWR_CTL_POWER_MODE_Msk          0x3UL
#define SRSS_V2_PWR_CTL_DEBUG_SESSION_Pos       4UL
#define SRSS_V2_PWR_CTL_DEBUG_SESSION_Msk       0x10UL
#define SRSS_V2_PWR_CTL_LPM_READY_Pos           5UL
#define SRSS_V2_PWR_CTL_LPM_READY_Msk           0x20UL
/* SRSS.PWR_CTL2 */
#define SRSS_V2_PWR_CTL2_LINREG_DIS_Pos         0UL
#define SRSS_V2_PWR_CTL2_LINREG_DIS_Msk         0x1UL
#define SRSS_V2_PWR_CTL2_LINREG_OK_Pos          1UL
#define SRSS_V2_PWR_CTL2_LINREG_OK_Msk          0x2UL
#define SRSS_V2_PWR_CTL2_LINREG_LPMODE_Pos      2UL
#define SRSS_V2_PWR_CTL2_LINREG_LPMODE_Msk      0x4UL
#define SRSS_V2_PWR_CTL2_DPSLP_REG_DIS_Pos      4UL
#define SRSS_V2_PWR_CTL2_DPSLP_REG_DIS_Msk      0x10UL
#define SRSS_V2_PWR_CTL2_RET_REG_DIS_Pos        8UL
#define SRSS_V2_PWR_CTL2_RET_REG_DIS_Msk        0x100UL
#define SRSS_V2_PWR_CTL2_NWELL_REG_DIS_Pos      12UL
#define SRSS_V2_PWR_CTL2_NWELL_REG_DIS_Msk      0x1000UL
#define SRSS_V2_PWR_CTL2_REFV_DIS_Pos           16UL
#define SRSS_V2_PWR_CTL2_REFV_DIS_Msk           0x10000UL
#define SRSS_V2_PWR_CTL2_REFV_OK_Pos            17UL
#define SRSS_V2_PWR_CTL2_REFV_OK_Msk            0x20000UL
#define SRSS_V2_PWR_CTL2_REFVBUF_DIS_Pos        20UL
#define SRSS_V2_PWR_CTL2_REFVBUF_DIS_Msk        0x100000UL
#define SRSS_V2_PWR_CTL2_REFVBUF_OK_Pos         21UL
#define SRSS_V2_PWR_CTL2_REFVBUF_OK_Msk         0x200000UL
#define SRSS_V2_PWR_CTL2_REFVBUF_LPMODE_Pos     22UL
#define SRSS_V2_PWR_CTL2_REFVBUF_LPMODE_Msk     0x400000UL
#define SRSS_V2_PWR_CTL2_REFI_DIS_Pos           24UL
#define SRSS_V2_PWR_CTL2_REFI_DIS_Msk           0x1000000UL
#define SRSS_V2_PWR_CTL2_REFI_OK_Pos            25UL
#define SRSS_V2_PWR_CTL2_REFI_OK_Msk            0x2000000UL
#define SRSS_V2_PWR_CTL2_REFI_LPMODE_Pos        26UL
#define SRSS_V2_PWR_CTL2_REFI_LPMODE_Msk        0x4000000UL
#define SRSS_V2_PWR_CTL2_PORBOD_LPMODE_Pos      27UL
#define SRSS_V2_PWR_CTL2_PORBOD_LPMODE_Msk      0x8000000UL
#define SRSS_V2_PWR_CTL2_BGREF_LPMODE_Pos       28UL
#define SRSS_V2_PWR_CTL2_BGREF_LPMODE_Msk       0x10000000UL
#define SRSS_V2_PWR_CTL2_PLL_LS_BYPASS_Pos      31UL
#define SRSS_V2_PWR_CTL2_PLL_LS_BYPASS_Msk      0x80000000UL
/* SRSS.PWR_HIBERNATE */
#define SRSS_V2_PWR_HIBERNATE_TOKEN_Pos         0UL
#define SRSS_V2_PWR_HIBERNATE_TOKEN_Msk         0xFFUL
#define SRSS_V2_PWR_HIBERNATE_UNLOCK_Pos        8UL
#define SRSS_V2_PWR_HIBERNATE_UNLOCK_Msk        0xFF00UL
#define SRSS_V2_PWR_HIBERNATE_FREEZE_Pos        17UL
#define SRSS_V2_PWR_HIBERNATE_FREEZE_Msk        0x20000UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBALARM_Pos 18UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBALARM_Msk 0x40000UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBWDT_Pos   19UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBWDT_Msk   0x80000UL
#define SRSS_V2_PWR_HIBERNATE_POLARITY_HIBPIN_Pos 20UL
#define SRSS_V2_PWR_HIBERNATE_POLARITY_HIBPIN_Msk 0xF00000UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBPIN_Pos   24UL
#define SRSS_V2_PWR_HIBERNATE_MASK_HIBPIN_Msk   0xF000000UL
#define SRSS_V2_PWR_HIBERNATE_HIBERNATE_DISABLE_Pos 30UL
#define SRSS_V2_PWR_HIBERNATE_HIBERNATE_DISABLE_Msk 0x40000000UL
#define SRSS_V2_PWR_HIBERNATE_HIBERNATE_Pos     31UL
#define SRSS_V2_PWR_HIBERNATE_HIBERNATE_Msk     0x80000000UL
/* SRSS.PWR_BUCK_CTL */
#define SRSS_V2_PWR_BUCK_CTL_BUCK_OUT1_SEL_Pos  0UL
#define SRSS_V2_PWR_BUCK_CTL_BUCK_OUT1_SEL_Msk  0x7UL
#define SRSS_V2_PWR_BUCK_CTL_BUCK_EN_Pos        30UL
#define SRSS_V2_PWR_BUCK_CTL_BUCK_EN_Msk        0x40000000UL
#define SRSS_V2_PWR_BUCK_CTL_BUCK_OUT1_EN_Pos   31UL
#define SRSS_V2_PWR_BUCK_CTL_BUCK_OUT1_EN_Msk   0x80000000UL
/* SRSS.PWR_BUCK_CTL2 */
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_SEL_Pos 0UL
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_SEL_Msk 0x7UL
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL_Pos 30UL
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL_Msk 0x40000000UL
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_EN_Pos  31UL
#define SRSS_V2_PWR_BUCK_CTL2_BUCK_OUT2_EN_Msk  0x80000000UL
/* SRSS.PWR_SSV_CTL */
#define SRSS_V2_PWR_SSV_CTL_BODVDDD_VSEL_Pos    0UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDD_VSEL_Msk    0x1UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDD_ENABLE_Pos  3UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDD_ENABLE_Msk  0x8UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_VSEL_Pos    4UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_VSEL_Msk    0x10UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_ACTION_Pos  6UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_ACTION_Msk  0xC0UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_ENABLE_Pos  8UL
#define SRSS_V2_PWR_SSV_CTL_BODVDDA_ENABLE_Msk  0x100UL
#define SRSS_V2_PWR_SSV_CTL_BODVCCD_ENABLE_Pos  11UL
#define SRSS_V2_PWR_SSV_CTL_BODVCCD_ENABLE_Msk  0x800UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDD_VSEL_Pos    16UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDD_VSEL_Msk    0x10000UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDD_ENABLE_Pos  19UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDD_ENABLE_Msk  0x80000UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_VSEL_Pos    20UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_VSEL_Msk    0x100000UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_ACTION_Pos  22UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_ACTION_Msk  0xC00000UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_ENABLE_Pos  24UL
#define SRSS_V2_PWR_SSV_CTL_OVDVDDA_ENABLE_Msk  0x1000000UL
#define SRSS_V2_PWR_SSV_CTL_OVDVCCD_ENABLE_Pos  27UL
#define SRSS_V2_PWR_SSV_CTL_OVDVCCD_ENABLE_Msk  0x8000000UL
/* SRSS.PWR_SSV_STATUS */
#define SRSS_V2_PWR_SSV_STATUS_BODVDDD_OK_Pos   0UL
#define SRSS_V2_PWR_SSV_STATUS_BODVDDD_OK_Msk   0x1UL
#define SRSS_V2_PWR_SSV_STATUS_BODVDDA_OK_Pos   1UL
#define SRSS_V2_PWR_SSV_STATUS_BODVDDA_OK_Msk   0x2UL
#define SRSS_V2_PWR_SSV_STATUS_BODVCCD_OK_Pos   2UL
#define SRSS_V2_PWR_SSV_STATUS_BODVCCD_OK_Msk   0x4UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVDDD_OK_Pos   8UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVDDD_OK_Msk   0x100UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVDDA_OK_Pos   9UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVDDA_OK_Msk   0x200UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVCCD_OK_Pos   10UL
#define SRSS_V2_PWR_SSV_STATUS_OVDVCCD_OK_Msk   0x400UL
#define SRSS_V2_PWR_SSV_STATUS_OCD_ACT_LINREG_OK_Pos 16UL
#define SRSS_V2_PWR_SSV_STATUS_OCD_ACT_LINREG_OK_Msk 0x10000UL
#define SRSS_V2_PWR_SSV_STATUS_OCD_DPSLP_REG_OK_Pos 17UL
#define SRSS_V2_PWR_SSV_STATUS_OCD_DPSLP_REG_OK_Msk 0x20000UL
/* SRSS.PWR_LVD_CTL */
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_TRIPSEL_Pos  0UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_TRIPSEL_Msk  0xFUL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_SRCSEL_Pos   4UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_SRCSEL_Msk   0x70UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EN_Pos       7UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EN_Msk       0x80UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_TRIPSEL_HT_Pos 8UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_TRIPSEL_HT_Msk 0x1F00UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_DPSLP_EN_HT_Pos 14UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_DPSLP_EN_HT_Msk 0x4000UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EN_HT_Pos    15UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EN_HT_Msk    0x8000UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EDGE_SEL_Pos 16UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_EDGE_SEL_Msk 0x30000UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_ACTION_Pos   18UL
#define SRSS_V2_PWR_LVD_CTL_HVLVD1_ACTION_Msk   0x40000UL
/* SRSS.PWR_LVD_CTL2 */
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_TRIPSEL_HT_Pos 8UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_TRIPSEL_HT_Msk 0x1F00UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_DPSLP_EN_HT_Pos 14UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_DPSLP_EN_HT_Msk 0x4000UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_EN_HT_Pos   15UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_EN_HT_Msk   0x8000UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_EDGE_SEL_Pos 16UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_EDGE_SEL_Msk 0x30000UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_ACTION_Pos  18UL
#define SRSS_V2_PWR_LVD_CTL2_HVLVD2_ACTION_Msk  0x40000UL
/* SRSS.PWR_HIB_DATA */
#define SRSS_V2_PWR_HIB_DATA_HIB_DATA_Pos       0UL
#define SRSS_V2_PWR_HIB_DATA_HIB_DATA_Msk       0xFFFFFFFFUL
/* SRSS.CLK_PATH_SELECT */
#define SRSS_V2_CLK_PATH_SELECT_PATH_MUX_Pos    0UL
#define SRSS_V2_CLK_PATH_SELECT_PATH_MUX_Msk    0x7UL
/* SRSS.CLK_ROOT_SELECT */
#define SRSS_V2_CLK_ROOT_SELECT_ROOT_MUX_Pos    0UL
#define SRSS_V2_CLK_ROOT_SELECT_ROOT_MUX_Msk    0xFUL
#define SRSS_V2_CLK_ROOT_SELECT_ROOT_DIV_Pos    4UL
#define SRSS_V2_CLK_ROOT_SELECT_ROOT_DIV_Msk    0x30UL
#define SRSS_V2_CLK_ROOT_SELECT_ENABLE_Pos      31UL
#define SRSS_V2_CLK_ROOT_SELECT_ENABLE_Msk      0x80000000UL
/* SRSS.CLK_SELECT */
#define SRSS_V2_CLK_SELECT_LFCLK_SEL_Pos        0UL
#define SRSS_V2_CLK_SELECT_LFCLK_SEL_Msk        0x7UL
#define SRSS_V2_CLK_SELECT_PUMP_SEL_Pos         8UL
#define SRSS_V2_CLK_SELECT_PUMP_SEL_Msk         0xF00UL
#define SRSS_V2_CLK_SELECT_PUMP_DIV_Pos         12UL
#define SRSS_V2_CLK_SELECT_PUMP_DIV_Msk         0x7000UL
#define SRSS_V2_CLK_SELECT_PUMP_ENABLE_Pos      15UL
#define SRSS_V2_CLK_SELECT_PUMP_ENABLE_Msk      0x8000UL
/* SRSS.CLK_TIMER_CTL */
#define SRSS_V2_CLK_TIMER_CTL_TIMER_SEL_Pos     0UL
#define SRSS_V2_CLK_TIMER_CTL_TIMER_SEL_Msk     0x1UL
#define SRSS_V2_CLK_TIMER_CTL_TIMER_HF0_DIV_Pos 8UL
#define SRSS_V2_CLK_TIMER_CTL_TIMER_HF0_DIV_Msk 0x300UL
#define SRSS_V2_CLK_TIMER_CTL_TIMER_DIV_Pos     16UL
#define SRSS_V2_CLK_TIMER_CTL_TIMER_DIV_Msk     0xFF0000UL
#define SRSS_V2_CLK_TIMER_CTL_ENABLE_Pos        31UL
#define SRSS_V2_CLK_TIMER_CTL_ENABLE_Msk        0x80000000UL
/* SRSS.CLK_ILO0_CONFIG */
#define SRSS_V2_CLK_ILO0_CONFIG_ILO0_BACKUP_Pos 0UL
#define SRSS_V2_CLK_ILO0_CONFIG_ILO0_BACKUP_Msk 0x1UL
#define SRSS_V2_CLK_ILO0_CONFIG_ILO0_MON_ENABLE_Pos 30UL
#define SRSS_V2_CLK_ILO0_CONFIG_ILO0_MON_ENABLE_Msk 0x40000000UL
#define SRSS_V2_CLK_ILO0_CONFIG_ENABLE_Pos      31UL
#define SRSS_V2_CLK_ILO0_CONFIG_ENABLE_Msk      0x80000000UL
/* SRSS.CLK_ILO1_CONFIG */
#define SRSS_V2_CLK_ILO1_CONFIG_ILO1_MON_ENABLE_Pos 30UL
#define SRSS_V2_CLK_ILO1_CONFIG_ILO1_MON_ENABLE_Msk 0x40000000UL
#define SRSS_V2_CLK_ILO1_CONFIG_ENABLE_Pos      31UL
#define SRSS_V2_CLK_ILO1_CONFIG_ENABLE_Msk      0x80000000UL
/* SRSS.CLK_IMO_CONFIG */
#define SRSS_V2_CLK_IMO_CONFIG_ENABLE_Pos       31UL
#define SRSS_V2_CLK_IMO_CONFIG_ENABLE_Msk       0x80000000UL
/* SRSS.CLK_ECO_CONFIG */
#define SRSS_V2_CLK_ECO_CONFIG_AGC_EN_Pos       1UL
#define SRSS_V2_CLK_ECO_CONFIG_AGC_EN_Msk       0x2UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_DIV_DISABLE_Pos 27UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_DIV_DISABLE_Msk 0x8000000UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_DIV_ENABLE_Pos 28UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_DIV_ENABLE_Msk 0x10000000UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_EN_Pos       31UL
#define SRSS_V2_CLK_ECO_CONFIG_ECO_EN_Msk       0x80000000UL
/* SRSS.CLK_ECO_PRESCALE */
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_DIV_ENABLED_Pos 0UL
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_DIV_ENABLED_Msk 0x1UL
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_FRAC_DIV_Pos 8UL
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_FRAC_DIV_Msk 0xFF00UL
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_INT_DIV_Pos 16UL
#define SRSS_V2_CLK_ECO_PRESCALE_ECO_INT_DIV_Msk 0x3FF0000UL
/* SRSS.CLK_ECO_STATUS */
#define SRSS_V2_CLK_ECO_STATUS_ECO_OK_Pos       0UL
#define SRSS_V2_CLK_ECO_STATUS_ECO_OK_Msk       0x1UL
#define SRSS_V2_CLK_ECO_STATUS_ECO_READY_Pos    1UL
#define SRSS_V2_CLK_ECO_STATUS_ECO_READY_Msk    0x2UL
/* SRSS.CLK_PILO_CONFIG */
#define SRSS_V2_CLK_PILO_CONFIG_PILO_FFREQ_Pos  0UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_FFREQ_Msk  0x3FFUL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_CLK_EN_Pos 29UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_CLK_EN_Msk 0x20000000UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_RESET_N_Pos 30UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_RESET_N_Msk 0x40000000UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_EN_Pos     31UL
#define SRSS_V2_CLK_PILO_CONFIG_PILO_EN_Msk     0x80000000UL
/* SRSS.CLK_FLL_CONFIG */
#define SRSS_V2_CLK_FLL_CONFIG_FLL_MULT_Pos     0UL
#define SRSS_V2_CLK_FLL_CONFIG_FLL_MULT_Msk     0x3FFFFUL
#define SRSS_V2_CLK_FLL_CONFIG_FLL_OUTPUT_DIV_Pos 24UL
#define SRSS_V2_CLK_FLL_CONFIG_FLL_OUTPUT_DIV_Msk 0x1000000UL
#define SRSS_V2_CLK_FLL_CONFIG_FLL_ENABLE_Pos   31UL
#define SRSS_V2_CLK_FLL_CONFIG_FLL_ENABLE_Msk   0x80000000UL
/* SRSS.CLK_FLL_CONFIG2 */
#define SRSS_V2_CLK_FLL_CONFIG2_FLL_REF_DIV_Pos 0UL
#define SRSS_V2_CLK_FLL_CONFIG2_FLL_REF_DIV_Msk 0x1FFFUL
#define SRSS_V2_CLK_FLL_CONFIG2_LOCK_TOL_Pos    16UL
#define SRSS_V2_CLK_FLL_CONFIG2_LOCK_TOL_Msk    0xFF0000UL
#define SRSS_V2_CLK_FLL_CONFIG2_UPDATE_TOL_Pos  24UL
#define SRSS_V2_CLK_FLL_CONFIG2_UPDATE_TOL_Msk  0xFF000000UL
/* SRSS.CLK_FLL_CONFIG3 */
#define SRSS_V2_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Pos 0UL
#define SRSS_V2_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Msk 0xFUL
#define SRSS_V2_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Pos 4UL
#define SRSS_V2_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Msk 0xF0UL
#define SRSS_V2_CLK_FLL_CONFIG3_SETTLING_COUNT_Pos 8UL
#define SRSS_V2_CLK_FLL_CONFIG3_SETTLING_COUNT_Msk 0x1FFF00UL
#define SRSS_V2_CLK_FLL_CONFIG3_BYPASS_SEL_Pos  28UL
#define SRSS_V2_CLK_FLL_CONFIG3_BYPASS_SEL_Msk  0x30000000UL
/* SRSS.CLK_FLL_CONFIG4 */
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_LIMIT_Pos   0UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_LIMIT_Msk   0xFFUL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_RANGE_Pos   8UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_RANGE_Msk   0x700UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_FREQ_Pos    16UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_FREQ_Msk    0x1FF0000UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_HW_UPDATE_DIS_Pos 30UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_HW_UPDATE_DIS_Msk 0x40000000UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_ENABLE_Pos  31UL
#define SRSS_V2_CLK_FLL_CONFIG4_CCO_ENABLE_Msk  0x80000000UL
/* SRSS.CLK_FLL_STATUS */
#define SRSS_V2_CLK_FLL_STATUS_LOCKED_Pos       0UL
#define SRSS_V2_CLK_FLL_STATUS_LOCKED_Msk       0x1UL
#define SRSS_V2_CLK_FLL_STATUS_UNLOCK_OCCURRED_Pos 1UL
#define SRSS_V2_CLK_FLL_STATUS_UNLOCK_OCCURRED_Msk 0x2UL
#define SRSS_V2_CLK_FLL_STATUS_CCO_READY_Pos    2UL
#define SRSS_V2_CLK_FLL_STATUS_CCO_READY_Msk    0x4UL
/* SRSS.CLK_ECO_CONFIG2 */
#define SRSS_V2_CLK_ECO_CONFIG2_WDTRIM_Pos      0UL
#define SRSS_V2_CLK_ECO_CONFIG2_WDTRIM_Msk      0x7UL
#define SRSS_V2_CLK_ECO_CONFIG2_ATRIM_Pos       4UL
#define SRSS_V2_CLK_ECO_CONFIG2_ATRIM_Msk       0xF0UL
#define SRSS_V2_CLK_ECO_CONFIG2_FTRIM_Pos       8UL
#define SRSS_V2_CLK_ECO_CONFIG2_FTRIM_Msk       0x300UL
#define SRSS_V2_CLK_ECO_CONFIG2_RTRIM_Pos       10UL
#define SRSS_V2_CLK_ECO_CONFIG2_RTRIM_Msk       0xC00UL
#define SRSS_V2_CLK_ECO_CONFIG2_GTRIM_Pos       12UL
#define SRSS_V2_CLK_ECO_CONFIG2_GTRIM_Msk       0x7000UL
/* SRSS.CLK_PLL_CONFIG */
#define SRSS_V2_CLK_PLL_CONFIG_FEEDBACK_DIV_Pos 0UL
#define SRSS_V2_CLK_PLL_CONFIG_FEEDBACK_DIV_Msk 0x7FUL
#define SRSS_V2_CLK_PLL_CONFIG_REFERENCE_DIV_Pos 8UL
#define SRSS_V2_CLK_PLL_CONFIG_REFERENCE_DIV_Msk 0x1F00UL
#define SRSS_V2_CLK_PLL_CONFIG_OUTPUT_DIV_Pos   16UL
#define SRSS_V2_CLK_PLL_CONFIG_OUTPUT_DIV_Msk   0x1F0000UL
#define SRSS_V2_CLK_PLL_CONFIG_LOCK_DELAY_Pos   25UL
#define SRSS_V2_CLK_PLL_CONFIG_LOCK_DELAY_Msk   0x6000000UL
#define SRSS_V2_CLK_PLL_CONFIG_PLL_LF_MODE_Pos  27UL
#define SRSS_V2_CLK_PLL_CONFIG_PLL_LF_MODE_Msk  0x8000000UL
#define SRSS_V2_CLK_PLL_CONFIG_BYPASS_SEL_Pos   28UL
#define SRSS_V2_CLK_PLL_CONFIG_BYPASS_SEL_Msk   0x30000000UL
#define SRSS_V2_CLK_PLL_CONFIG_ENABLE_Pos       31UL
#define SRSS_V2_CLK_PLL_CONFIG_ENABLE_Msk       0x80000000UL
/* SRSS.CLK_PLL_STATUS */
#define SRSS_V2_CLK_PLL_STATUS_LOCKED_Pos       0UL
#define SRSS_V2_CLK_PLL_STATUS_LOCKED_Msk       0x1UL
#define SRSS_V2_CLK_PLL_STATUS_UNLOCK_OCCURRED_Pos 1UL
#define SRSS_V2_CLK_PLL_STATUS_UNLOCK_OCCURRED_Msk 0x2UL
/* SRSS.CSV_REF_SEL */
#define SRSS_V2_CSV_REF_SEL_REF_MUX_Pos         0UL
#define SRSS_V2_CSV_REF_SEL_REF_MUX_Msk         0x7UL
/* SRSS.RES_CAUSE */
#define SRSS_V2_RES_CAUSE_RESET_WDT_Pos         0UL
#define SRSS_V2_RES_CAUSE_RESET_WDT_Msk         0x1UL
#define SRSS_V2_RES_CAUSE_RESET_ACT_FAULT_Pos   1UL
#define SRSS_V2_RES_CAUSE_RESET_ACT_FAULT_Msk   0x2UL
#define SRSS_V2_RES_CAUSE_RESET_DPSLP_FAULT_Pos 2UL
#define SRSS_V2_RES_CAUSE_RESET_DPSLP_FAULT_Msk 0x4UL
#define SRSS_V2_RES_CAUSE_RESET_TC_DBGRESET_Pos 3UL
#define SRSS_V2_RES_CAUSE_RESET_TC_DBGRESET_Msk 0x8UL
#define SRSS_V2_RES_CAUSE_RESET_SOFT_Pos        4UL
#define SRSS_V2_RES_CAUSE_RESET_SOFT_Msk        0x10UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT0_Pos      5UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT0_Msk      0x20UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT1_Pos      6UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT1_Msk      0x40UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT2_Pos      7UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT2_Msk      0x80UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT3_Pos      8UL
#define SRSS_V2_RES_CAUSE_RESET_MCWDT3_Msk      0x100UL
#define SRSS_V2_RES_CAUSE_RESET_XRES_Pos        16UL
#define SRSS_V2_RES_CAUSE_RESET_XRES_Msk        0x10000UL
#define SRSS_V2_RES_CAUSE_RESET_BODVDDD_Pos     17UL
#define SRSS_V2_RES_CAUSE_RESET_BODVDDD_Msk     0x20000UL
#define SRSS_V2_RES_CAUSE_RESET_BODVDDA_Pos     18UL
#define SRSS_V2_RES_CAUSE_RESET_BODVDDA_Msk     0x40000UL
#define SRSS_V2_RES_CAUSE_RESET_BODVCCD_Pos     19UL
#define SRSS_V2_RES_CAUSE_RESET_BODVCCD_Msk     0x80000UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVDDD_Pos     20UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVDDD_Msk     0x100000UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVDDA_Pos     21UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVDDA_Msk     0x200000UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVCCD_Pos     22UL
#define SRSS_V2_RES_CAUSE_RESET_OVDVCCD_Msk     0x400000UL
#define SRSS_V2_RES_CAUSE_RESET_OCD_ACT_LINREG_Pos 23UL
#define SRSS_V2_RES_CAUSE_RESET_OCD_ACT_LINREG_Msk 0x800000UL
#define SRSS_V2_RES_CAUSE_RESET_OCD_DPSLP_LINREG_Pos 24UL
#define SRSS_V2_RES_CAUSE_RESET_OCD_DPSLP_LINREG_Msk 0x1000000UL
#define SRSS_V2_RES_CAUSE_RESET_PXRES_Pos       28UL
#define SRSS_V2_RES_CAUSE_RESET_PXRES_Msk       0x10000000UL
#define SRSS_V2_RES_CAUSE_RESET_STRUCT_XRES_Pos 29UL
#define SRSS_V2_RES_CAUSE_RESET_STRUCT_XRES_Msk 0x20000000UL
#define SRSS_V2_RES_CAUSE_RESET_PORVDDD_Pos     30UL
#define SRSS_V2_RES_CAUSE_RESET_PORVDDD_Msk     0x40000000UL
/* SRSS.RES_CAUSE2 */
#define SRSS_V2_RES_CAUSE2_RESET_CSV_HF_Pos     0UL
#define SRSS_V2_RES_CAUSE2_RESET_CSV_HF_Msk     0xFFFFUL
#define SRSS_V2_RES_CAUSE2_RESET_CSV_REF_Pos    16UL
#define SRSS_V2_RES_CAUSE2_RESET_CSV_REF_Msk    0x10000UL
/* SRSS.CLK_TRIM_ILO0_CTL */
#define SRSS_V2_CLK_TRIM_ILO0_CTL_ILO0_FTRIM_Pos 0UL
#define SRSS_V2_CLK_TRIM_ILO0_CTL_ILO0_FTRIM_Msk 0x3FUL
#define SRSS_V2_CLK_TRIM_ILO0_CTL_ILO0_MONTRIM_Pos 8UL
#define SRSS_V2_CLK_TRIM_ILO0_CTL_ILO0_MONTRIM_Msk 0xF00UL
/* SRSS.PWR_TRIM_PWRSYS_CTL */
#define SRSS_V2_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Pos 0UL
#define SRSS_V2_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Msk 0x1FUL
#define SRSS_V2_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Pos 30UL
#define SRSS_V2_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Msk 0xC0000000UL
/* SRSS.CLK_TRIM_PILO_CTL */
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_CFREQ_Pos 0UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_CFREQ_Msk 0x3FUL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Pos 12UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Msk 0x7000UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Pos 16UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Msk 0x30000UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Pos 18UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Msk 0xC0000UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Pos 20UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Msk 0x1F00000UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Pos 26UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Msk 0xC000000UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Pos 28UL
#define SRSS_V2_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Msk 0x70000000UL
/* SRSS.CLK_TRIM_PILO_CTL2 */
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Pos 0UL
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Msk 0xFFUL
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Pos 8UL
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Msk 0x1F00UL
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Pos 16UL
#define SRSS_V2_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Msk 0xFF0000UL
/* SRSS.CLK_TRIM_PILO_CTL3 */
#define SRSS_V2_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Pos 0UL
#define SRSS_V2_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Msk 0xFFFFUL
/* SRSS.CLK_TRIM_ILO1_CTL */
#define SRSS_V2_CLK_TRIM_ILO1_CTL_ILO1_FTRIM_Pos 0UL
#define SRSS_V2_CLK_TRIM_ILO1_CTL_ILO1_FTRIM_Msk 0x3FUL
#define SRSS_V2_CLK_TRIM_ILO1_CTL_ILO1_MONTRIM_Pos 8UL
#define SRSS_V2_CLK_TRIM_ILO1_CTL_ILO1_MONTRIM_Msk 0xF00UL


#endif /* _CYIP_SRSS_V2_H_ */


/* [] END OF FILE */
